# Алекс✌️, [12/7/2022 10:39 PM]
# Сегодня задачка была: сообщение шифруют шифром Цезаря но со сдвигом -2 . Т.е. буква "в" - это "а", "г" - "б" и т.д.

# Алекс✌️, [12/7/2022 10:40 PM]
# Надо написать прогу, расшифровывающую сообщение стретвоокуф

abc = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]
word = "стретвоокуф"

def code(text, step):
    decryption = ""
    for a in text:
        for item in range(len(abc)):
            if a == str(abc[item]):
                decryption += abc[item-step]
    return(decryption)

print(code(word, 2))